Repository: BRAHIM-INFO/Vision_Pharmacy
Catalog: Vision_Pharmacy/Code/Resources_*.resx
Languages: ar

# btnLogin
source: Login
ar: تسجيل الدخول

# SwitchLang
source: English
ar: انجليزي

# ButtonSave
source: Save
ar: حفظ

# FormTitle
source: New User Form
ar: نموذج مستخدم جديد

# label2
source: Iraq Vision Pharmacy Management Program © 2025 - All Rights Reserved
ar: برنامج رؤيا العراق لإدارة الصيدليات © 2025 - جميع الحقوق محفوظة

# labelControl1
source: Password
ar: كلمة المرور

# labelControl2
source: Name User
ar: اسم المستخدم

# labelControl3
source: Welcome
ar: مرحبا بك

# LabelName
source: Name
ar: الاسم

# LabelNewUser
source: New User
ar: مستخدم جديد

# LabelPassword
source: Password
ar: كلمة السر

# LabelRole
source: Authority
ar: الصلاحية

# LabelUsername
source: Username
ar: اسم المستخدم

# lblTitle
source: Iraq Vision Pharmacy Management Program
ar: برنامج رؤيا العراق لإدارة الصيدليات

# RoleAdmin
source: Administrator
ar: مشرف

# RoleUser
source: User
ar: مستخدم

# AddButton_User
source: Add
ar: اضافة

# PrintButton_User
source: Print
ar: طباعة

# TitleUser
source: User List
ar: قائمة المستخدمين

# EmptyDataText
source: No data. Use the buttons above to perform data operations.
ar: لا يوجد بيانات. استخدم الازار اعلاه لاجراء العمليات على البيانات

# lblTitlePurchase
source: Purchase List
ar: قائمة المشتريات

# lblTitleMedicat
source: Medicine List
ar: قائمة الأدوية

# lblTitleExpired
source: Expired Medication List
ar: قائمة الأدوية المنتهية الصلاحية

# lblTitleEmp
source: Employee List
ar: قائمة الموظفين

# lblTitleAttend
source: Employee Attendance and Absence Recording
ar: تسجيل الغيابات و حظور الموظفين

# lblTitlePay
source: Employee Payroll List
ar: قائمة رواتب الموظفين

# lblTitleCustom
source: Customer List
ar: قائمة العملاء

# TitlePurchase
source: Purchase List
ar: قائمة المشتريات

# AddNotificationText
source: Add operation completed successfully
ar: تمت عملية الاضافة بنجاح

# DeleteActionCaption
source: Are you sure you want to do this? Data cannot be recovered.
ar: هل انت متأكد من هذا الاجراء. لا يمكن استرجاع البيانات

# DeleteActionText
source: Delete action
ar: اجراء حذف

# DeleteNotificationText
source: Delete operation completed successfully.
ar: تمت عملية الحذف بنجاح

# DeleteOutComeText
source: Delete action.
ar: اجراء حذف

# DeletOutComeCaption
source: This deletion operation does not affect existing items. If you are also removing items, you must edit them and then delete them.
ar: ان عملية الحذف هذه لا تؤثر على المواد ( المواد المتوفرة). اذا كنت بصدد ازالة المواد ايضا يجب عليك التعديل ثم الازالة

# DuplicateDataCaption
source: Some data, such as the ID, should not be repeated. Make sure to change it and try again.
ar: بعض البيانات لا يجب ان تتكرر مثل المعرف. تأكد من تغييرة ثم اعد المحاولة

# DuplicateDataText
source: Duplicate data.
ar: تكرار البيانات

# EditNotificationText
source: Edit operation successful.
ar: تمت عملية التعديل بنجاح

# EmptyGridViewCaption
source: The data grid is empty. Make sure you have selected a row to complete the operation.
ar: شبكة عرض البيانات فارغة. تأكد من اختيار صف لاتمام العملية

# EmptyGridViewText
source: Your data grid is empty.
ar: شبكة عرض البيانات لديك فارغة

# FiledsEmptyCaption
source: Fields marked with an asterisk (*) are required. Make sure you enter it correctly and try again.
ar: الحقول التي تحتوي على علامة * هي مطلوبة. تأكد من ادخالها ثم اعد المحاولة

# FiledsEmptyText
source: Some fields are required.
ar: بعض الحقول مطلوبة

# GeneralText
source: Warehouse.
ar: مخزن

# InvalidInputCaption
source: Please enter a valid value.
ar: يرجى ادخال قيمة صحيحة

# InvalidIputText
source: Input error.
ar: خطأ ادخال

# OnDamgeCaption
source: The item will be moved to the damaged section.
ar: سيتم نقل المادة الى قسم المواد التالفة

# OnDamgeText
source: Action Destroy
ar: اجراء اتلاف

# OutOfConscinceCaption
source: The item will be moved to the Out of Conscince section.
ar: سيتم نقل المادة الى قسم المواد التي خارج الذمة

# OutOfConscinceText
source: Move Out of Conscience.
ar: نقل خارج الذمة

# QuantityMaterialCaption
source: The added quantity cannot be greater than the available quantity. Check the quantity for the current item and make sure it is greater than or equal to zero, then try again.
ar: لا يمكن ان تكون الكمية المضافة اكبر من الكمية المتوفرة, انظر الى الكمية للمادة الحالية وتأكد من انها اكبر او لا تساوي صفر ثم اعد المحاولة

# QuantityMaterialText
source: Invalid quantity.
ar: كمية غير صحيحة

# SavedDataCaption
source: It appears that you did not save and have added data. We'll keep it, and you can refer to it in the next add operation.
ar: يبدو انك لم تقم بعملية الحفظ ولديك بيانات مضافة. سوف نحتفظ بها ويمكنك الرجوع لها في عملية الاضافة القادمة

# SavedDataText
source: Remember!
ar: تذكر !

# ServerConnectionCaption
source: It seems you're having a problem with this operation. This could be due to several reasons, including a connection between this data and other data that needs to be deleted first. It could also be due to incorrect server installation, incorrect access permissions, an uninstalled database, or a database connection error. You can modify the connection text in the system settings, or you can contact the system administrator to resolve the issue.
ar: يبدو ان لديك مشكلة في في هذه العملية وهذا يعزى الى عده اسباب من بينها علاقة تربط هذه البيانات في بيانات اخرى يجب حذفها اولا او ريما عدم صحة تثبيت السيرفر او صلاحيات الوصول او عدم تثبيت قاعدة البيانات او خطأ في الاتصال في قاعدة البيانات. يمكنك تعديل نص الاتصال في اعدادات النظام او يمكنك الاتصال في مدير النظام لحل المشكلة

# ServerConnectionText
source: Database connection error.
ar: خطأ في الاتصال في قاعدة البيانات

# ShowDeleteMaterialCaption
source: This action will completely delete the material from here and from other materials.
ar: ان هذا الاجراء يؤدي الى حذف المادة بشكل كامل من هنا وايضا من المواد

# ShowMoveDamgeCaption
source: This action will completely delete the material, and other materials will be affected.
ar: تؤدي هذه العملية الى حذف المادة بشكل كامل وسيتم التأثير في المواد

# ShowMoveDamgeText
source: Delete Material.
ar: حذف مادة

# ShowRowsCaption
source: For sensitivity, you must select "Complete." The line. If you want to delete the entire data, you can press CTRL+A.
ar: لحساسية اجراء الحذف لابد لك ان تقوم بأختيار كامل السطر, واذا اردت حذف كامل البيانات يمكنك الضغط CTRL+A

# ShowRowText
source: Make sure to select the entire line to delete.
ar: تأكد من اختيار كامل السطر لحذفة
